[
  {
    "word": "adjacent",
    "pos": "-",
    "meaning": "A room, building, piece of land etc that is adjacent to something is next to it."
  },
  {
    "word": "albeit",
    "pos": "-",
    "meaning": "Used to add information that reduces the force or importance of what you have just said."
  },
  {
    "word": "assemble",
    "pos": "-",
    "meaning": "If you assemble a large number of people or things, or if they assemble, they are gathered together in one place, often for a particular purpose."
  },
  {
    "word": "collapse",
    "pos": "-",
    "meaning": "If a building, wall etc collapses, it falls down suddenly, usually because it is weak or damaged."
  },
  {
    "word": "colleague",
    "pos": "-",
    "meaning": "Someone you work with – used especially by professional people."
  },
  {
    "word": "compile",
    "pos": "-",
    "meaning": "To make a book, list, record etc, using different pieces of information, music etc."
  },
  {
    "word": "conceive",
    "pos": "-",
    "meaning": "To imagine a particular situation or to think about something in a particular way."
  },
  {
    "word": "convince",
    "pos": "-",
    "meaning": "To make someone feel certain that something is true."
  },
  {
    "word": "depress",
    "pos": "-",
    "meaning": "To make someone feel very unhappy."
  },
  {
    "word": "encounter",
    "pos": "-",
    "meaning": "To experience something, especially problems or opposition."
  },
  {
    "word": "enormous",
    "pos": "-",
    "meaning": "Very big in size or in amount."
  },
  {
    "word": "forthcoming",
    "pos": "-",
    "meaning": "A forthcoming event, meeting etc is one that has been planned to happen soon."
  },
  {
    "word": "incline",
    "pos": "-",
    "meaning": "If a situation, fact etc inclines you to do or think something, it influences you towards a particular action or opinion."
  },
  {
    "word": "integrity",
    "pos": "-",
    "meaning": "The quality of being honest and strong about what you believe to be right."
  },
  {
    "word": "intrinsic",
    "pos": "-",
    "meaning": "Being part of the nature or character of someone or something."
  },
  {
    "word": "invoke",
    "pos": "-",
    "meaning": "If you invoke a law, rule etc, you say that you are doing something because the law allows or forces you to."
  },
  {
    "word": "levy",
    "pos": "-",
    "meaning": "To officially say that people must pay a tax or charge."
  },
  {
    "word": "likewise",
    "pos": "-",
    "meaning": "In the same way."
  },
  {
    "word": "nonetheless",
    "pos": "-",
    "meaning": "In spite of the fact that has just been mentioned."
  },
  {
    "word": "notwithstanding",
    "pos": "-",
    "meaning": "In spite of something."
  }
]
