[
  {
    "word": "Convergent / Convergence",
    "pos": "-",
    "meaning": "Coming closer together / The fact that two or more things, ideas, etc. become similar or come together"
  },
  {
    "word": "Divergent / Divergence",
    "pos": "-",
    "meaning": "Different or becoming different from something else / The situation in which two things become different"
  },
  {
    "word": "Direct Comparison Test",
    "pos": "-",
    "meaning": "In mathematics, the comparison test, sometimes called the direct comparison test to distinguish it from similar related tests (especially the limit comparison test), provides a way of deducing the convergence or divergence of an infinite series or an improper integral."
  },
  {
    "word": "Limit Comparison Test",
    "pos": "-",
    "meaning": "In mathematics, the limit comparison test (LCT) (in contrast with the related direct comparison test) is a method of testing for the convergence of an infinite series."
  },
  {
    "word": "Arc Length / Arc Length Function",
    "pos": "-",
    "meaning": "Arc length is the distance between two points along a section of a curve."
  },
  {
    "word": "Moment",
    "pos": "n",
    "meaning": "In mathematics, the moments of a function are quantitative measures related to the shape of the function's graph."
  },
  {
    "word": "Center of Mass",
    "pos": "n",
    "meaning": "The center of mass is a position defined relative to an object or system of objects. It is the average position of all the parts of the system, weighted according to their masses."
  },
  {
    "word": "Smooth Curve/Surface",
    "pos": "-",
    "meaning": "A smooth curve is a curve which is a smooth function, where the word 'curve' is interpreted in the analytic geometry context. In particular, a smooth curve is a continuous map f from a one-dimensional space to an n-dimensional space on which its domain has continuous derivatives up to a desired order."
  },
  {
    "word": "Surface of Revolution",
    "pos": "-",
    "meaning": "A surface of revolution is a surface generated by rotating a two-dimensional curve about an axis."
  },
  {
    "word": "Surface Area",
    "pos": "-",
    "meaning": "Surface area is the area of a given surface."
  },
  {
    "word": "Origin",
    "pos": "n",
    "meaning": "In a Cartesian coordinate system, the origin is the point where the axes of the system intersect. In a polar coordinate system, the origin may also be called the pole."
  },
  {
    "word": "Parametric Equation/Curve",
    "pos": "-",
    "meaning": "One of two or more equations expressing the location of a point on a curve or surface by determining each coordinate separately."
  },
  {
    "word": "Parameter",
    "pos": "n",
    "meaning": "Parameter, in mathematics, a variable for which the range of possible values identifies a collection of distinct cases in a problem."
  },
  {
    "word": "Cycloid",
    "pos": "n",
    "meaning": "Cycloid, the curve generated by a point on the circumference of a circle that rolls along a straight line. If r is the radius of the circle and θ (theta) is the angular displacement of the circle, then the polar equations of the curve are x = r(θ - sin θ) and y = r(1 - cos θ)."
  },
  {
    "word": "Arch",
    "pos": "n",
    "meaning": "Arch, in architecture and civil engineering, a curved member that is used to span an opening and to support loads from above. The arch formed the basis for the evolution of the vault."
  },
  {
    "word": "Intersection",
    "pos": "n",
    "meaning": "An occasion when two lines cross, or the place where this happens."
  },
  {
    "word": "Curvature",
    "pos": "n",
    "meaning": "(at a point on a curve) The derivative of the inclination of the tangent with respect to arc length."
  },
  {
    "word": "Polar Coordinate",
    "pos": "n",
    "meaning": "A pair of coordinates locating the position of a point in a plane, the first being the length of the straight line (r) connecting the point to the origin, and the second the angle (θ) made by this line with a fixed line."
  },
  {
    "word": "Pole",
    "pos": "n",
    "meaning": "Either of two completely opposite or different opinions, positions, or qualities."
  },
  {
    "word": "Polar Axis",
    "pos": "n",
    "meaning": "In mathematics, the polar coordinate system is a two-dimensional coordinate system in which each point on a plane is determined by a distance from a reference point and an angle from a reference direction."
  }
]
